<?php
// +----------------------------------------------------------------------
// | Dagger [ WE CAN DO IT JUST Dagger ]
// +----------------------------------------------------------------------
// | Date: 2017-4-18
// +----------------------------------------------------------------------
// | Author: shilong chen <sloan1993@163.com>
// +----------------------------------------------------------------------

// 应用入口文件

// 检测PHP环境
if(version_compare(PHP_VERSION,'5.4.0','<'))  die('require PHP > 5.4.0 !');

// 开启调试模式 建议开发阶段开启 部署阶段注释或者设为false
define('APP_DEBUG',True);

// 引入ThinkPHP入口文件
require '../dagger/app.php';
// var_dump( __FILE__ );
dagger\app::run();